app/workers/track_location_worker.rb

INSERT INTO `trip_histories` (`trip_id`, `longitude`, `latitude`, `created_at`, `updated_at`) VALUES (3, 5461112, 544784, '2019-09-24 00:28:21.785189', '2019-09-24 00:28:21.785189')
---
  def perform(location_params)
    location = TripHistory.create(location_params)