app/controllers/trips_controller.rb

SELECT COUNT(*) FROM `trips`
SELECT `trips`.* FROM `trips` LIMIT 10 OFFSET 0
---
  def index
    trips = Trip.paginate(pagination_params)

INSERT INTO `trips` (`name`, `description`, `status`, `created_at`, `updated_at`) VALUES ('trip 1', 'desc trip 1', 1, '2019-09-22 23:37:54.379447', '2019-09-22 23:37:54.379447')
---
  def create
    @trip = Trip.new(trip_params)

    if @trip.save

UPDATE `trips` SET `trips`.`status` = 0, `trips`.`updated_at` = '2019-09-22 23:38:09.234485' WHERE `trips`.`id` = 2
---
  def update
    if @trip.update(trip_params)

DELETE FROM `trips` WHERE `trips`.`id` = 1
---
  def destroy
    @trip.destroy

SELECT `trips`.* FROM `trips` WHERE `trips`.`id` = 6 LIMIT 1
---
    def set_trip
      @trip = Trip.find(params[:id])